anachrocomputer/STM32_MCP4822/ArmDds.c
            style = LED_DOT_STYLE;
            colour = LED_COLOUR;
            break;
         case 's':   // Sine
         case 'S':
            for (i = 0; i < 256; i++) {
               const double theta = delta * (double)i;
               Wave[i] = (sin(theta) * 2047) + 2048;
            }
            break;
         case 't':   // Triangle
         case 'T':
            for (i = 0; i < 256; i++) {
               if (i < 128)
                  Wave[i] = i * 32;
               else
                  Wave[i] = (255 - i) * 32;
            }
            break;
         case 'q':   // Square
         case 'Q':
            for (i = 0; i < 256; i++) {
               if (i < 128)
                  Wave[i] = 4095;
               else
                  Wave[i] = 0;
            }
            break;
         case 'x':
         case 'X':
            style = PANAPLEX_STYLE;
            colour = PANAPLEX_COLOUR;
            break;
         case 'y':
         case 'Y':
            style = LED_BAR_STYLE;
            colour = LED_COLOUR;
            break;
         case 'z':
         case 'Z':
            memset(Frame, 0, sizeof (Frame));
            updscreen(0, MAXY - 1);
            break;
         }
      }
      
      if (UART6RxAvailable()) {
         const uint8_t ch = UART6RxByte();
         
         //printf("UART6: %02x\n", ch);
         
         if (ch & 0x80) {
            midiStatus = ch;
            midiByte = 1;
         }
         else {
            switch (midiByte) {
            case 1:
               if (midiStatus == 0x90) {
                  midiNoteNumber = ch;
                  midiByte++;
               }
               break;
            case 2:
               if (midiStatus == 0x90) {
                  midiVelocity = ch;
                  midiByte = 1;
                  
                  if (midiVelocity == 0) {
                     printf("MIDI: NOTE OFF %d\n", midiNoteNumber);
                     PhaseInc = 0;
                     GPIOB->BSRR = GPIO_BSRR_BR13; // GPIO pin PB13 LOW, GATE off
                  }
                  else {
                     printf("MIDI: NOTE ON %d %s%d %d\n", midiNoteNumber, NoteNames[midiNoteNumber % 12], (midiNoteNumber / 12) - 1, midiVelocity);
                     PhaseInc = IncTab[midiNoteNumber];
                     GPIOB->BSRR = GPIO_BSRR_BS13; // GPIO pin PB13 HIGH, GATE on
                     GPIOB->BSRR = GPIO_BSRR_BS14; // GPIO pin PB14 HIGH, TRIGGER on
                     triggerOff = millis() + 10;
                     DacB = 0xb000 | (((midiNoteNumber - 32) * 64) & 0x0fff);
                     fillRect(0, 47, 127, 63, SSD1351_WHITE, SSD1351_BLACK);
                     fillRect(1, 48, (midiNoteNumber - 32) * 2, 62, SSD1351_BLUE, SSD1351_BLUE);
                     updscreen(47, 63);
                  }
               }
               break;
            }
         }
      }
   }
}

